Revit 2024 API
Glazing Class
 A static class that provides access to the property names that appear in the Glazing visual asset schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static class Glazing
Visual Basic
Public NotInheritable Class Glazing
Visual C++
public ref class Glazing abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.Glazing
See Also
Glazing Members
Autodesk.Revit.DB.Visual Namespace